{
  "title": "QAOA",
  "subtitle": "Quantum Approximate Optimization Algorithm",
  "description": "Quantum Approximate Optimization Algorithm (QAOA) – Notebook Description\n\nThis notebook implements the Quantum Approximate Optimization Algorithm for two representative combinatorial problems: Max‑Cut on a five‑node graph and a small knapsack instance. It starts with an accessible explanation of the QAOA ansatz as alternating “cost” and “mixer” layers applied to an initial uniform superposition, and relates the finite‑depth circuit to discretized adiabatic evolution. For Max‑Cut, the notebook defines a normalized, negative cost function over bitstrings, constructs the corresponding phase‑separation circuit, and applies layerwise RX mixers.\n\nUsing Classiq’s modeling and execution tools, the notebook builds a parameterized QAOA circuit, sets up a classical COBYLA optimization loop, and iteratively refines the 2p parameters (gammas and betas) by repeatedly estimating the quantum cost. It then samples the optimized circuit, prints the most probable cuts along with their costs, and visualizes the graph with node colors indicating the best partitions. In the knapsack section, the notebook augments QAOA with a digital constraint check: an objective phase is applied only when a predicate qubit indicates the weight constraint is satisfied, avoiding hand‑tuned penalty terms.\n\nKey points:\n- Explains the QAOA framework and its connection to adiabatic optimization.\n- Implements modular cost and mixer layers and composes them into a multi‑layer ansatz.\n- Uses a classical optimizer to tune QAOA parameters based on sampled quantum costs.\n- Demonstrates Max‑Cut and knapsack instances, printing and plotting high‑quality solutions.\n- Includes technical notes on adiabatic theorem conditions and the Trotterization viewpoint of QAOA.",
  "friendly_name": "QAOA",
  "vertical_tags": [],
  "problem_domain_tags": [],
  "qmod_type": [],
  "level": []
}
