{
  "title": "HHL",
  "subtitle": "Solving linear system of equations using HHL algorithm",
  "description": "HHL Algorithm for Quantum Linear Solvers – Notebook Description\n\nThis notebook implements the Harrow–Hassidim–Lloyd (HHL) algorithm for solving linear systems A x = b and compares quantum results with a classical solution. It begins with a small 4×4 Hermitian matrix A and a normalized right‑hand side vector b, checks that A’s eigenvalues lie in (0, 1), and prints their high‑precision binary expansions. The matrix is converted into a Pauli‑sum Hamiltonian, setting up the unitary U = e^{i 2π A} required by QPE.\n\nA modular HHL quantum subroutine is then built: it prepares |b⟩ in a “memory” register, runs flexible QPE to encode eigenphases into an “estimator” register, applies a controlled rotation on an indicator qubit implementing the λ⁻¹ map via an amplitude table, and finally uncomputes the phases with QPE†. Post‑processing routines post‑select on successful indicator and estimator outcomes, reconstruct the solution amplitudes, remove the global phase, and compare the resulting |x⟩ to the classical A⁻¹b via fidelity and component‑wise plots. The notebook provides two implementations of the time‑evolution unitary: an exact one using full matrix exponentiation and an approximate one based on first‑order Suzuki–Trotter product formulas with tunable repetition depth.\n\nKey points:\n- Reviews the HHL algorithm steps, including QPE, eigenvalue inversion, and post‑selection.\n- Encodes a small Hermitian system into a Pauli‑operator Hamiltonian and constructs U = e^{i 2π A}.\n- Implements a reusable `hhl` Qmod function parameterized by a powered‑unitary evolution routine.\n- Demonstrates exact vs. Suzuki–Trotter‑based Hamiltonian simulation within the same HHL framework.\n- Includes utilities to post‑select, remove global phase, compute fidelity, and visualize classical vs quantum solutions.",
  "friendly_name": "HHL",
  "vertical_tags": [],
  "problem_domain_tags": ["machine learning", "linear equation"],
  "qmod_type": ["algorithms"],
  "level": ["advanced", "demos"]
}
